 # Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N

# def get_prime_factors(N):
#     factors = list()
#     divisor = 2
#     while(divisor <= N):
#         if(N % divisor) == 0:
#             factors.append(divisor)
#             N = N/divisor
#     else:
#             divisor += 1

#     return factors
# x = int(input('введите число '))
# factor = get_prime_factors(x)
# print(factor)
